scripts/xcoord/results/poc0_20260223_152937/bench_cpu_stress_pinned.txt
INFO 02-23 15:34:22 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x73ab234a12d0>, seed=0, num_prompts=50, dataset_name='sharegpt', no_stream=False, dataset_path='/home/yunwei37/workspace/gpu/gpu_ext/workloads/llama.cpp/datasets/sharegpt_vicuna.json', no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://127.0.0.1:8013', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='ggml-org_gpt-oss-20b-GGUF_gpt-oss-20b-mxfp4', tokenizer='Qwen/Qwen3-30B-A3B-FP8', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 25:04:06 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 50/50 [00:52<00:00,  1.06s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     40        
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  52.82     
Total input tokens:                      10229     
Total generated tokens:                  9493      
Request throughput (req/s):              0.76      
Output token throughput (tok/s):         179.71    
Peak output token throughput (tok/s):    260.00    
Peak concurrent requests:                3.00      
Total Token throughput (tok/s):          373.35    
---------------Time to First Token----------------
Mean TTFT (ms):                          74.53     
Median TTFT (ms):                        71.89     
P99 TTFT (ms):                           230.38    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.62      
Median TPOT (ms):                        4.40      
P99 TPOT (ms):                           6.56      
---------------Inter-token Latency----------------
Mean ITL (ms):                           4.50      
Median ITL (ms):                         3.89      
P99 ITL (ms):                            8.88      
==================================================